Repository: mpasternak/django-flexible-reports
Catalog: flexible_reports/locale/*/LC_MESSAGES/django.po
Languages: pl

source: An error occured while trying to run the actual database query (%(error)s)
pl: Wystąpił błąd podczas próby uruchomienia faktycznego zapytania do bazy danych (%(error)s)

source: DSL query
pl: Zapytanie w języku DSL

source: Report's elements
pl: Składowe raportu

source: Columns
pl: Kolumny

source: (group name:
pl: (nazwa grupy:

source: Sort option
pl: Jak sortować

source: Base model
pl: Podstawowy model

source: Label
pl: Etykieta

source: Title
pl: Tytuł

source: Position
pl: Pozycja

source: Sortable
pl: Zezwalaj na sortowanie

source: Attribute name
pl: Nazwa atrybutu

source: Attribute name on the parent table's base model. If this column is sortable, that attribute is used to sort this column. In case no value is given in "Template" field, this attribute will be used to get information from model instances. Warning, if you want to make this column sortable, you need to provide this value. This value can contain dot notation to reference fields in related models.
pl: Nazwa atrybutu bazowego modelu określonego dla tabeli-rodzica. Jeżeli ta kolumna jest sortowalna, ten atrybut zostanie użyty, aby sortować wartości w tabeli. W przypadku braku danych w polu „Templatka”, wartość tego pola będzie użyta aby pobrać informacje z modeli bazodanowych. Uwaga, jeżeli chcesz uczynić tą kolumnę sortowalną, to musisz dostarczyć tą wartość. Ta wartość może zawierać odnośniki do pól powiązanych zapisaną w notacji z kropką.

source: Template
pl: Templatka

source: If empty, the value of the object's attribute from "Attribute name" field will be used instead. Template will get following values in it's context: - *record* -- data record for the current row - *value* -- value from `record` that corresponds to the current column - *default* -- appropriate default value to use as fallback
pl: Jeżeli pozostawisz to pole puste, to zostanie użyta wartość atrybutu obiektu określona w polu „Nazwa atrybutu”. Templatka otrzyma następujące wartości w swoim kontekście: - *record* - rekord danych dla danego wiersza, - *value* - wartość z pola „rekord” odnosząca się do danej kolumny, - *default* - domyślna wartość dla tej kolumny

source: HTML attributes
pl: Atrybuty HTML

source: Display totals
pl: Wyświetlaj podsumowanie

source: Display column totals in footer. For columns without Attribute name, this will be total number of the rows.
pl: Wyświetla zsumowaną wartość w stopce kolumny. Dla kolumn gdzie wartość pola „Nazwa atrybutu” jest pusta, to będzie całkowita liczba wierszy.

source: Strip HTML on export
pl: Usuwaj HTML przy eksporcie

source: Strip HTML tags when exporting to other, non-browser formats, like MS Word or MS Excel.
pl: Usuwaj tagi HTML przy eksporcie danych do innych, nie-przeglądarkowych formatów, jak MS Word lub MS Excel.

source: Exclude from export
pl: Wyłączaj z eksportu

source: Exclude this column when exporting to other, non-browserformats, like MS Word or MS Excel
pl: Wyłącz to pole z eksportu przy eksporcie danych do innych, nie-przeglądarkowych formatów, jak MS Word lub MS Excel

source: Footer template
pl: Templatka stopki

source: Template for footer. Used only if "Display totals" is enabled. It is rendered with 3 variables: - *count* -- total count of rows in the table, - *value* -- sum of this column's values (or row count if non-numeric), - *error* -- string representation of exception in case an exception occurs during addition of column's values. So, if the column values are numbers, just use {{ value }}. If you want to output number of rows, just use {{ count }}.
pl: Templatka dla stopki. Używana tylko gdy „Wyświetlaj podsumowanie” jest włączone. Templatka renderowana jest w kontekście 3 zmiennych: - *count* — całkowita ilość wierszy w tabeli, - *value* — suma wartości w tej kolumnie (lub całkowita ilość wierszy w tabeli, jeżeli wartości kolumny są nie-numeryczne), - *error* — tekstowa reprezentacja wyjątku w sytuacji, gdy wystąpi wyjątek podczas dodawania wartości tej kolumny. Zatem, jeżeli wartości tej kolumny to liczby, użyj {{ value }}. Jeżeli chcesz wyświetlić ilość wierszy, użyj {{ count }}.

source: Column
pl: Kolumna

source: '%(attr_name)s' is not a valid value for base model '%(base_model)s' (exception: %(exception)s).
pl: „%(attr_name)s” nie jest właściwą wartością dla modelu „%(base_model)s” (wyjątek: %(exception)s).

source: You marked this column as sortable. You must enter value into "Attribute name" field.
pl: Zaznaczyłeś/aś tą kolumnę jako sortowalną. Musisz wprowadzić nazwę atrybutu w polu „Nazwa atrybutu”.

source: You must either enter a template for this column or an attribute name.
pl: Musisz uzupełnić kod templatki lub nazwę atrybutu dla tej kolumny.

source: If 'Display totals' is enabled, you should provide a footer template. Perhaps try with a very basic and default one, like '{{ value }}'.
pl: Jeżeli „Wyświetlaj podsumowanie” jest włączone, powinieneś/aś dostarczyć templatkę dla stopki. Spróbuj wpisać tam domyślną wartość, jak np. „{{value}}” (bez cudzysłowu).

source: Distinct
pl: Unikaj powtórzeń

source: Output only distinct records
pl: Wyświetla jedynie unikalne rekordy, bez powtórzeń

source: Datasource
pl: Źródło danych

source: Datasources
pl: Źródła danych

source: Parent
pl: Rodzic

source: Data from
pl: Dane z

source: datasource
pl: źródło danych

source: except catchall
pl: wszystkie rekordy oprócz pasujących do źródeł danych raportu

source: Fill only if 'datasource' has been chosen in 'Data from' field
pl: Wybierz jedynie, gdy „źródło danych” zostało wybrane w polu „Dane z”

source: Fill only if 'except catchall' is selected in 'Data from' field
pl: Wybierz jedynie, gdy „wszystkie rekordy oprócz pasujących do źródeł danych raportu” zostało wybrane w polu „Dane z”

source: Table
pl: Tabela

source: Slug
pl: Skrót

source: In case when data is from except-catchall, please specify an empty datasource.
pl: W przypadku gdy dane pochodzą ze wszystkich rekordów prócz pasujących do źródeł danych, proszę nie wybierać źródła danych.

source: In case when data is from except-catchall, please specify a base model.
pl: W przypadku gdy dane pochodzą ze wszystkich rekordów prócz pasujących do źródeł danych, proszę wybrać podstawowy model danych.

source: Please specify a datasource.
pl: Proszę o określenie źródła danych.

source: Please specify an empty base model.
pl: Nie wybieraj modelu podstawowego.

source: Report element
pl: Składowa raportu

source: Report elements
pl: Składowe raportu

source: Reports
pl: Raporty

source: Report
pl: Raport

source: sort with other tables
pl: sortuj wraz z innymi tabelami

source: if a column in this table is sorted, all the other tables on the page with columns with identical name will be sorted too, as long as they also are marked as 'sort with other tables'
pl: jeżeli kolumna w tej tabeli zostanie użyta do posortowania, to wszystkie inne tabele na tej stronie z kolumnami identycznie nazwanymi również będą posortowane, o ile są one oznaczone jako „sortuj wraz z innymi tabelami”

source: sort individually
pl: sortuj indywidualnie

source: this table will be sorted individually; even if other tables on the page have columns with same label this table will be sorted independently
pl: ta tabela będzie sortowana indywidualnie; nawet, jeżeli inne tabele na tej stronie mają kolumny z tą samą etykietą, to ta tabela będzie sortowana niezależnie

source: sort in group
pl: sortuj w grupie

source: this table will be sorted together with a group of tables; you must enter a prefix for this group
pl: ta tabela będzie sortowana razem z innymi w grupie tabel; musisz wprowadzić nazwę grupy

source: Descending
pl: Malejąco

source: Column order information
pl: Informacja o sortowaniu kolumn

source: Column order informations
pl: Informacje o sortowaniu kolumn

source: Group prefix
pl: Nazwa grupy

source: this value is used as a prefix only when "Sort option" is set to "sort in group"
pl: ta wartość jest używana jako nazwa grupy jedynie w sytuacji, gdy sortowanie jest ustalone na „sortuj w grupie”

source: Empty template
pl: Pusta templatka

source: Template which will be displayed when there is no data for this table.
pl: Templatka, która zostanie wyświetlona gdy nie ma danych dla tej tabeli.

source: There is no data for this table.
pl: Nie znaleziono takich rekordów.

source: Tables
pl: Tabele

source: Please enter group prefix if you want to sort in group
pl: Proszę wpisać prefiks grupy, jeżeli chcesz sortować tą tabelę w grupie

source: Cannot compile template (%(exception)s)
pl: Nie mogę skompilować kodu templatki (wyjątek: %(exception)s)
